themes/Mytravel/Template/Blocks/FormSearchAllService.php

select * from `bravo_tour_category` where `status` = 'publish' and `bravo_tour_category`.`deleted_at` is null
---
    public function content($model = [])
    {
        $model['bg_image_url'] = FileHelper::url($model['bg_image'] ?? "", 'full') ?? "";
        $model['list_location'] = $model['tour_location'] =  Location::where("status","publish")->limit(1000)->orderBy('name', 'asc')->with(['translation'])->get()->toTree();
        $model['tour_category'] = TourCategory::where('status', 'publish')->with(['translation'])->get()->toTree();